//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using UnityEngine.SceneManagement;
using System.Collections;
//========================================================================
// ■ Field_Manager
//------------------------------------------------------------------------
//	フィールド場面の管理クラス。
//========================================================================

public class Field_Manager : Scene_Manager {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	float end_second;	// ゲームが終了する秒数
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	protected override void Start() {
		base.Start();

		end_second = 5 * 60 + Time.time;	// 5分後に終了を設定
	}
	//--------------------------------------------------------------------
	// ● 更新
	//--------------------------------------------------------------------
	protected override void Update() {
		base.Update();

		// 終了秒に到達したか、BackSpaceボタンが押された場合
		if ( end_second < Time.time || Input.GetKeyDown(KeyCode.Backspace) )
			SceneManager.LoadScene("Test_Score");	// テスト場面に遷移

		// 終了までの秒数をデバッグ表示
		Debug_EX.add( "end_second : " + (end_second - Time.time) );
	}
}